Revit 2027 API
BackgroundProcessTaskType Class
 BackgroundProcessTaskType
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GuidEnum
 Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskType
Namespace: Autodesk.Revit.DB.BackgroundProcessTask
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class BackgroundProcessTaskType : GuidEnum
Public Class BackgroundProcessTaskType
	Inherits GuidEnum
public ref class BackgroundProcessTaskType : public GuidEnum
type BackgroundProcessTaskType =
    class
        inherit GuidEnum
    end
The BackgroundProcessTaskType type exposes the following members.
Constructors
Name | Description
BackgroundProcessTaskType | Creates a new BackgroundProcessTaskType instance.
Top
Properties
Name | Description
Guid |  The Guid of GUID-based enum object.
(Inherited from GuidEnum)
Top
Methods
Name | Description
Equals |  Compares two Guid-based enum object based on their concrete class and GUID value.
(Inherited from GuidEnum)
GetHashCode |  Generates a hash code for this Guid-based enum object.
(Inherited from GuidEnum)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Operators
Name | Description
Equality(BackgroundProcessTaskType, BackgroundProcessTaskType) | Compares two BackgroundProcessTaskType instances.
Inequality(BackgroundProcessTaskType, BackgroundProcessTaskType) | Compares two BackgroundProcessTaskType instances.
Top
See Also
Reference
Autodesk.Revit.DB.BackgroundProcessTask Namespace